wlgwgz/CCC/Code/PDL/devices/fm4/s6e2h1xe/common/s6e2h1xe.h
#define bFM_MFT2_ADCMP_ACSD5_AMOD                 *((volatile  uint8_t *)(0x42443D20UL))
#define bFM4_MFT2_ADCMP_ACSD5_AMOD                *((volatile  uint8_t *)(0x42443D20UL))
#define bFM_MFT2_ADCMP_ACSD5_OCUS                 *((volatile  uint8_t *)(0x42443D24UL))
#define bFM4_MFT2_ADCMP_ACSD5_OCUS                *((volatile  uint8_t *)(0x42443D24UL))
#define bFM_MFT2_ADCMP_ACSD5_DE                   *((volatile  uint8_t *)(0x42443D30UL))
#define bFM4_MFT2_ADCMP_ACSD5_DE                  *((volatile  uint8_t *)(0x42443D30UL))
#define bFM_MFT2_ADCMP_ACSD5_PE                   *((volatile  uint8_t *)(0x42443D34UL))
#define bFM4_MFT2_ADCMP_ACSD5_PE                  *((volatile  uint8_t *)(0x42443D34UL))
#define bFM_MFT2_ADCMP_ACSD5_UE                   *((volatile  uint8_t *)(0x42443D38UL))
#define bFM4_MFT2_ADCMP_ACSD5_UE                  *((volatile  uint8_t *)(0x42443D38UL))
#define bFM_MFT2_ADCMP_ACSD5_ZE                   *((volatile  uint8_t *)(0x42443D3CUL))
#define bFM4_MFT2_ADCMP_ACSD5_ZE                  *((volatile  uint8_t *)(0x42443D3CUL))

#define bFM_MFT2_FRT_TCAL_STOP00                  *((volatile  uint32_t*)(0x42442C80UL))
#define bFM4_MFT2_FRT_TCAL_STOP00                 *((volatile  uint32_t*)(0x42442C80UL))
#define bFM_MFT2_FRT_TCAL_STOP01                  *((volatile  uint32_t*)(0x42442C84UL))
#define bFM4_MFT2_FRT_TCAL_STOP01                 *((volatile  uint32_t*)(0x42442C84UL))
#define bFM_MFT2_FRT_TCAL_STOP02                  *((volatile  uint32_t*)(0x42442C88UL))
#define bFM4_MFT2_FRT_TCAL_STOP02                 *((volatile  uint32_t*)(0x42442C88UL))
#define bFM_MFT2_FRT_TCAL_STOP10                  *((volatile  uint32_t*)(0x42442C8CUL))
#define bFM4_MFT2_FRT_TCAL_STOP10                 *((volatile  uint32_t*)(0x42442C8CUL))
#define bFM_MFT2_FRT_TCAL_STOP11                  *((volatile  uint32_t*)(0x42442C90UL))
#define bFM4_MFT2_FRT_TCAL_STOP11                 *((volatile  uint32_t*)(0x42442C90UL))
#define bFM_MFT2_FRT_TCAL_STOP12                  *((volatile  uint32_t*)(0x42442C94UL))
#define bFM4_MFT2_FRT_TCAL_STOP12                 *((volatile  uint32_t*)(0x42442C94UL))
#define bFM_MFT2_FRT_TCAL_STOP20                  *((volatile  uint32_t*)(0x42442C98UL))
#define bFM4_MFT2_FRT_TCAL_STOP20                 *((volatile  uint32_t*)(0x42442C98UL))
#define bFM_MFT2_FRT_TCAL_STOP21                  *((volatile  uint32_t*)(0x42442C9CUL))
#define bFM4_MFT2_FRT_TCAL_STOP21                 *((volatile  uint32_t*)(0x42442C9CUL))
#define bFM_MFT2_FRT_TCAL_STOP22                  *((volatile  uint32_t*)(0x42442CA0UL))
#define bFM4_MFT2_FRT_TCAL_STOP22                 *((volatile  uint32_t*)(0x42442CA0UL))
#define bFM_MFT2_FRT_TCAL_SCLR00                  *((volatile  uint32_t*)(0x42442CC0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR00                 *((volatile  uint32_t*)(0x42442CC0UL))
#define bFM_MFT2_FRT_TCAL_SCLR01                  *((volatile  uint32_t*)(0x42442CC4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR01                 *((volatile  uint32_t*)(0x42442CC4UL))
#define bFM_MFT2_FRT_TCAL_SCLR02                  *((volatile  uint32_t*)(0x42442CC8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR02                 *((volatile  uint32_t*)(0x42442CC8UL))
#define bFM_MFT2_FRT_TCAL_SCLR10                  *((volatile  uint32_t*)(0x42442CCCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR10                 *((volatile  uint32_t*)(0x42442CCCUL))
#define bFM_MFT2_FRT_TCAL_SCLR11                  *((volatile  uint32_t*)(0x42442CD0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR11                 *((volatile  uint32_t*)(0x42442CD0UL))
#define bFM_MFT2_FRT_TCAL_SCLR12                  *((volatile  uint32_t*)(0x42442CD4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR12                 *((volatile  uint32_t*)(0x42442CD4UL))
#define bFM_MFT2_FRT_TCAL_SCLR20                  *((volatile  uint32_t*)(0x42442CD8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR20                 *((volatile  uint32_t*)(0x42442CD8UL))
#define bFM_MFT2_FRT_TCAL_SCLR21                  *((volatile  uint32_t*)(0x42442CDCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR21                 *((volatile  uint32_t*)(0x42442CDCUL))
#define bFM_MFT2_FRT_TCAL_SCLR22                  *((volatile  uint32_t*)(0x42442CE0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR22                 *((volatile  uint32_t*)(0x42442CE0UL))

#define bFM_MFT2_FRT_TCSA0_SCLR                   *((volatile  uint8_t *)(0x42442910UL))
#define bFM4_MFT2_FRT_TCSA0_SCLR                  *((volatile  uint8_t *)(0x42442910UL))
#define bFM_MFT2_FRT_TCSA0_MODE                   *((volatile  uint8_t *)(0x42442914UL))
#define bFM4_MFT2_FRT_TCSA0_MODE                  *((volatile  uint8_t *)(0x42442914UL))
#define bFM_MFT2_FRT_TCSA0_STOP                   *((volatile  uint8_t *)(0x42442918UL))
#define bFM4_MFT2_FRT_TCSA0_STOP                  *((volatile  uint8_t *)(0x42442918UL))
#define bFM_MFT2_FRT_TCSA0_BFE                    *((volatile  uint8_t *)(0x4244291CUL))
#define bFM4_MFT2_FRT_TCSA0_BFE                   *((volatile  uint8_t *)(0x4244291CUL))
#define bFM_MFT2_FRT_TCSA0_ICRE                   *((volatile  uint8_t *)(0x42442920UL))
#define bFM4_MFT2_FRT_TCSA0_ICRE                  *((volatile  uint8_t *)(0x42442920UL))
#define bFM_MFT2_FRT_TCSA0_ICLR                   *((volatile  uint8_t *)(0x42442924UL))
#define bFM4_MFT2_FRT_TCSA0_ICLR                  *((volatile  uint8_t *)(0x42442924UL))
#define bFM_MFT2_FRT_TCSA0_IRQZE                  *((volatile  uint8_t *)(0x42442934UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZE                 *((volatile  uint8_t *)(0x42442934UL))
#define bFM_MFT2_FRT_TCSA0_IRQZF                  *((volatile  uint8_t *)(0x42442938UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZF                 *((volatile  uint8_t *)(0x42442938UL))
#define bFM_MFT2_FRT_TCSA0_ECKE                   *((volatile  uint8_t *)(0x4244293CUL))
#define bFM4_MFT2_FRT_TCSA0_ECKE                  *((volatile  uint8_t *)(0x4244293CUL))

#define bFM_MFT2_FRT_TCSA1_SCLR                   *((volatile  uint8_t *)(0x42442A90UL))
#define bFM4_MFT2_FRT_TCSA1_SCLR                  *((volatile  uint8_t *)(0x42442A90UL))
#define bFM_MFT2_FRT_TCSA1_MODE                   *((volatile  uint8_t *)(0x42442A94UL))
#define bFM4_MFT2_FRT_TCSA1_MODE                  *((volatile  uint8_t *)(0x42442A94UL))
#define bFM_MFT2_FRT_TCSA1_STOP                   *((volatile  uint8_t *)(0x42442A98UL))
#define bFM4_MFT2_FRT_TCSA1_STOP                  *((volatile  uint8_t *)(0x42442A98UL))
#define bFM_MFT2_FRT_TCSA1_BFE                    *((volatile  uint8_t *)(0x42442A9CUL))
#define bFM4_MFT2_FRT_TCSA1_BFE                   *((volatile  uint8_t *)(0x42442A9CUL))
#define bFM_MFT2_FRT_TCSA1_ICRE                   *((volatile  uint8_t *)(0x42442AA0UL))
#define bFM4_MFT2_FRT_TCSA1_ICRE                  *((volatile  uint8_t *)(0x42442AA0UL))
#define bFM_MFT2_FRT_TCSA1_ICLR                   *((volatile  uint8_t *)(0x42442AA4UL))
#define bFM4_MFT2_FRT_TCSA1_ICLR                  *((volatile  uint8_t *)(0x42442AA4UL))
#define bFM_MFT2_FRT_TCSA1_IRQZE                  *((volatile  uint8_t *)(0x42442AB4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZE                 *((volatile  uint8_t *)(0x42442AB4UL))
#define bFM_MFT2_FRT_TCSA1_IRQZF                  *((volatile  uint8_t *)(0x42442AB8UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZF                 *((volatile  uint8_t *)(0x42442AB8UL))
#define bFM_MFT2_FRT_TCSA1_ECKE                   *((volatile  uint8_t *)(0x42442ABCUL))
#define bFM4_MFT2_FRT_TCSA1_ECKE                  *((volatile  uint8_t *)(0x42442ABCUL))

#define bFM_MFT2_FRT_TCSA2_SCLR                   *((volatile  uint8_t *)(0x42442C10UL))
#define bFM4_MFT2_FRT_TCSA2_SCLR                  *((volatile  uint8_t *)(0x42442C10UL))
#define bFM_MFT2_FRT_TCSA2_MODE                   *((volatile  uint8_t *)(0x42442C14UL))
#define bFM4_MFT2_FRT_TCSA2_MODE                  *((volatile  uint8_t *)(0x42442C14UL))
#define bFM_MFT2_FRT_TCSA2_STOP                   *((volatile  uint8_t *)(0x42442C18UL))
#define bFM4_MFT2_FRT_TCSA2_STOP                  *((volatile  uint8_t *)(0x42442C18UL))
#define bFM_MFT2_FRT_TCSA2_BFE                    *((volatile  uint8_t *)(0x42442C1CUL))
#define bFM4_MFT2_FRT_TCSA2_BFE                   *((volatile  uint8_t *)(0x42442C1CUL))
#define bFM_MFT2_FRT_TCSA2_ICRE                   *((volatile  uint8_t *)(0x42442C20UL))
#define bFM4_MFT2_FRT_TCSA2_ICRE                  *((volatile  uint8_t *)(0x42442C20UL))
#define bFM_MFT2_FRT_TCSA2_ICLR                   *((volatile  uint8_t *)(0x42442C24UL))
#define bFM4_MFT2_FRT_TCSA2_ICLR                  *((volatile  uint8_t *)(0x42442C24UL))
#define bFM_MFT2_FRT_TCSA2_IRQZE                  *((volatile  uint8_t *)(0x42442C34UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZE                 *((volatile  uint8_t *)(0x42442C34UL))
#define bFM_MFT2_FRT_TCSA2_IRQZF                  *((volatile  uint8_t *)(0x42442C38UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZF                 *((volatile  uint8_t *)(0x42442C38UL))
#define bFM_MFT2_FRT_TCSA2_ECKE                   *((volatile  uint8_t *)(0x42442C3CUL))
#define bFM4_MFT2_FRT_TCSA2_ECKE                  *((volatile  uint8_t *)(0x42442C3CUL))

